Import

In [ ]:
from accelerate.utils import set_seed
from tqdm import tqdm

import json
import numpy as np
import random
import torch
from utils.functions import set_seed_all, set_result_filename, run_end2end, check_nltk_resource, swap_memory
import os
from datetime import datetime

from modules.llm_evaluator import LLMEvaluator, LLMLoraEvaluator, LLMReasoningEvaluator
from modules.llm_generator import LLMGenerator, LLMLoraGenerator

Parameters

In [2]:
llm_names =[
    "TinyLlama/TinyLlama-1.1B-Chat-v1.0", # generation
    "deepseek-ai/DeepSeek-R1-Distill-Qwen-1.5B",
    "stabilityai/stable-code-3b", # generation
    "deepseek-ai/deepseek-coder-1.3b-base",
    "deepseek-ai/deepseek-coder-1.3b-instruct", # generation
    "codellama/CodeLlama-7b-Instruct-hf",
    "codellama/CodeLlama-13b-Instruct-hf"
]


# generate lora model names
lora_model_names = []
for m in llm_names:
   lora_model_names.append( m.split("/")[1]+"_spider")

In [ ]:
seed = 42
device_swap = False # swap between cuda and cpu to save vram
evaluator_type = 'base' # 'base' / 'FT' / 'reason'
evaluator_setting = 'check' # 'base', 'check', 'exec', 'pro'
ft_type = 'NoExecResult' # 'withExecResult'

# evaluator
model_indx = 0 # choose the model to evaluate
evaluator_faliValue = -0.5
evaluator_max_new_tokens = 512
useSchema = False # Use schema as context for evaluator
evaluator_name = llm_names[model_indx] #base model name
model_savename = lora_model_names[model_indx] + "_" + ft_type #lora model save name
evaluation_config = f"configs/{evaluator_setting}.json"


print(f"evaluator_name: {evaluator_name}")
print(f"evaluator_lora: {model_savename}")
print(f"evaluator FT training type: {ft_type}")
print(f"evaluator_type: {evaluator_type}")
print(f"evaluator setup: {evaluator_setting}")
print(f"FT training type: {ft_type}")
print(f"Use Schema: {useSchema}")
print(f"evaluator_max_new_tokens: {evaluator_max_new_tokens}")
print(f"evaluation_config = {json.load(open(evaluation_config))}\n")

# generator
model_indx = 1 # choose the model to generate
generator_name = llm_names[model_indx] #base model name
generator_lora_savename = lora_model_names[model_indx] #lora model save name
print(f"generator_name: {generator_name}")
#print(f"generator_lora: {generator_lora_savename}")

prompt_method = 0 # 0 for tinyllama

# populate other parameters
current_directory = os.getcwd() #parameters
model_savedatapath = os.path.join(current_directory,f"checkpts/{model_savename}/model")
evaluator_peft_dir = model_savedatapath

curr_timestamp = datetime.now().strftime("%Y%m%d_%H%M%S")
test_fname = "data/spider_dev_400.json"
dataset_name = "spider"
db_path ="data/spider/database"
method_name = "greedy" # planning method: greedy, rerank, iterative, treesearch, prune
# result_fname: where the results will be saved for evaluation
result_fname = f"results/{set_result_filename(evaluator_name, generator_name, dataset_name, method_name, evaluator_type)}_{evaluator_setting}_e2e_t2_{curr_timestamp}" + ".sql" # where the results will be saved for evaluation
log_name = f"log/{set_result_filename(evaluator_name, generator_name, dataset_name, method_name, evaluator_type)}_{evaluator_setting}_e2e_t2_{curr_timestamp}" + ".json" # log for result generation
result_eval_fname = f"results/{set_result_filename(evaluator_name, generator_name, dataset_name, method_name, evaluator_type)}_{evaluator_setting}_e2e_t2_{curr_timestamp}" + ".txt" # evaluation report

retriever_gen = None # retriever generator
retriever_eval = None # retriever evaluator

"""
yes_token_indx: 
    the index of the token in the vocabulary that corresponds to the "Yes" text.
    CodeLlama-Instruct: "No" 1939 "Yes" 3869
    TinyLlama: "Yes" 3869
"""
yes_token_indx=None #3869

# print parameters
print(f"prompt_method: {prompt_method}")
print(f"method_name: {method_name}")
print(f"dataset_name: {dataset_name}")
print(f"\nResult output file name: {result_fname}\nLog file name: {log_name}\nEvaluation result file name: {result_eval_fname}")

evaluator_name: TinyLlama/TinyLlama-1.1B-Chat-v1.0
evaluator_lora: TinyLlama-1.1B-Chat-v1.0_spider_NoExecResult
evaluator FT training type: NoExecResult
evaluator_type: base
evaluator setup: check
FT training type: NoExecResult
Use Schema: False
evaluator_max_new_tokens: 512
evaluation_config = {'check_exec': True, 'use_exec_res': False}

generator_name: deepseek-ai/DeepSeek-R1-Distill-Qwen-1.5B
prompt_method: 0
method_name: greedy
dataset_name: spider

Result output file name: results/DeepSeek-R1-Distill-Qwen-1.5B_TinyLlama-1.1B-Chat-v1.0_base_spider_greedy_check_e2e_t2_20250220_174605.sql
Log file name: log/DeepSeek-R1-Distill-Qwen-1.5B_TinyLlama-1.1B-Chat-v1.0_base_spider_greedy_check_e2e_t2_20250220_174605.json
Evaluation result file name: results/DeepSeek-R1-Distill-Qwen-1.5B_TinyLlama-1.1B-Chat-v1.0_base_spider_greedy_check_e2e_t2_20250220_174605.txt

In [4]:
# set seed
set_seed_all(seed)

Load Evaluator LLM

In [5]:
if method_name != "greedy":
    if evaluator_type == 'base':
        evaluator = LLMEvaluator(evaluator_name, db_path, device="cuda",yes_token_indx=yes_token_indx)
        print(f"Loaded base model")
    elif evaluator_type == 'FT':
        evaluator = LLMLoraEvaluator(evaluator_name, evaluator_peft_dir, db_path, device="cuda",yes_token_indx=yes_token_indx)
        print(f"Loaded LoRA FT model")
    else:
        evaluator = LLMReasoningEvaluator(evaluator_name, db_path, device="cuda",\
                                       failvalue=evaluator_faliValue, max_new_tokens=evaluator_max_new_tokens)
        print(f"Loaded for reasoning")

    # move model to cpu for now
    if device_swap:
        swap_memory(evaluator.model, device="cpu",verbose=True)

    #yindx=evaluator.get_yes_token()
    #print(f"Yes token index: {yindx}")
else:
    evaluator = None
    print('Generated empty evaluator')

Generated empty evaluator

Load Generator LLM

In [6]:
generator = LLMGenerator(generator_name, device="cuda")
#generator = LLMLoraGenerator(generator_name, generator_peft_dir, device="cuda")

# move model to cpu for now
if device_swap:
    swap_memory(generator.model, device="cpu",verbose=True)

# param check
if method_name == "greedy" and device_swap:
    print("Caution: you enabled device_swap during Greedy method. This will be slow..")

Planning method

In [ ]:
if method_name == "rerank":
    from modules.llm_planner import rerank as planner
    generation_config = "configs/temp_sampling.json" # there are two configs for generation: temp_sampling.json (5 candidates) and greedy.json (1 candidate)

elif method_name == "greedy":
    from modules.llm_planner import greedy as planner
    generation_config = "configs/greedy.json"

elif method_name == "iterative":
    from modules.llm_planner import iter_correction as planner
    generation_config = "configs/temp_sampling.json"

elif method_name == "prune":
    from modules.llm_planner import prune as planner
    generation_config = "configs/temp_sampling.json"

elif method_name == "treesearch":
    from modules.llm_planner import tree_search_mc as planner
    generation_config = "configs/temp_sampling.json"

else:
    raise ValueError(f"Unknown planning method: {method_name}")
print(f"LLM planner: {method_name}")

LLM planner: greedy

Summary of params and models

In [8]:
import json 
print(f"evaluator_name: {evaluator_name}")
print(f"evaluator_lora: {model_savename}")
print(f"evaluator_type: {evaluator_type}")
print(f"evaluator setup: {evaluator_setting}")
print(f"evaluation_config = {json.load(open(evaluation_config))}\n")
print(f"generator_name: {generator_name}")
print(f"prompt_method: {prompt_method}")
print(f"method_name: {method_name}")
print(f"dataset_name: {dataset_name}")
print(f"LLM planner: {method_name}")
print(f"generation_config = {json.load(open(generation_config))}")
print(f"\nResult output file name: {result_fname}\nLog file name: {log_name}\nEvaluation result file name: {result_eval_fname}")


params_log={
   "evaluator_name": evaluator_name,
   "evaluator_lora": model_savename,
   "evaluator_peft_dir": evaluator_peft_dir,
   "evaluator_type": evaluator_type,
   "evaluator_setting": evaluator_setting,
   "evaluation_config": json.load(open(evaluation_config)),
   "FT training type:": ft_type,
   "Use Schema in prompt": useSchema,
   "seed": seed,
   "test_fname": test_fname,
   "evaluator_faliValue": evaluator_faliValue,
   "evaluator_max_new_tokens": evaluator_max_new_tokens,
   "generator_name": generator_name,
   "generation_config": json.load(open(generation_config)),
   "prompt_method": prompt_method,
   "method_name": method_name,
   "dataset_name": dataset_name,
   "Result output file name": result_fname,
   "Log file name": log_name,
   "Evaluation result file name": result_eval_fname
}

print(json.dumps(params_log,indent=2))

evaluator_name: TinyLlama/TinyLlama-1.1B-Chat-v1.0
evaluator_lora: TinyLlama-1.1B-Chat-v1.0_spider_NoExecResult
evaluator_type: base
evaluator setup: check
evaluation_config = {'check_exec': True, 'use_exec_res': False}

generator_name: deepseek-ai/DeepSeek-R1-Distill-Qwen-1.5B
prompt_method: 0
method_name: greedy
dataset_name: spider
LLM planner: greedy
generation_config = {'_from_model_config': True, 'do_sample': True, 'temperature': 0.1, 'num_return_sequences': 1}

Result output file name: results/DeepSeek-R1-Distill-Qwen-1.5B_TinyLlama-1.1B-Chat-v1.0_base_spider_greedy_check_e2e_t2_20250220_174605.sql
Log file name: log/DeepSeek-R1-Distill-Qwen-1.5B_TinyLlama-1.1B-Chat-v1.0_base_spider_greedy_check_e2e_t2_20250220_174605.json
Evaluation result file name: results/DeepSeek-R1-Distill-Qwen-1.5B_TinyLlama-1.1B-Chat-v1.0_base_spider_greedy_check_e2e_t2_20250220_174605.txt
{
  "evaluator_name": "TinyLlama/TinyLlama-1.1B-Chat-v1.0",
  "evaluator_lora": "TinyLlama-1.1B-Chat-v1.0_spider_NoExecResult",
  "evaluator_peft_dir": "d:\\Research\\R1\\llm_planning_local\\checkpts/TinyLlama-1.1B-Chat-v1.0_spider_NoExecResult/model",
  "evaluator_type": "base",
  "evaluator_setting": "check",
  "evaluation_config": {
    "check_exec": true,
    "use_exec_res": false
  },
  "FT training type:": "NoExecResult",
  "Use Schema in prompt": false,
  "seed": 42,
  "test_fname": "data/spider_dev_400.json",
  "evaluator_faliValue": -0.5,
  "evaluator_max_new_tokens": 512,
  "generator_name": "deepseek-ai/DeepSeek-R1-Distill-Qwen-1.5B",
  "generation_config": {
    "_from_model_config": true,
    "do_sample": true,
    "temperature": 0.1,
    "num_return_sequences": 1
  },
  "prompt_method": 0,
  "method_name": "greedy",
  "dataset_name": "spider",
  "Result output file name": "results/DeepSeek-R1-Distill-Qwen-1.5B_TinyLlama-1.1B-Chat-v1.0_base_spider_greedy_check_e2e_t2_20250220_174605.sql",
  "Log file name": "log/DeepSeek-R1-Distill-Qwen-1.5B_TinyLlama-1.1B-Chat-v1.0_base_spider_greedy_check_e2e_t2_20250220_174605.json",
  "Evaluation result file name": "results/DeepSeek-R1-Distill-Qwen-1.5B_TinyLlama-1.1B-Chat-v1.0_base_spider_greedy_check_e2e_t2_20250220_174605.txt"
}

Prepare test dataset for evaluation

TODO: 
- extend/ modify preprocess.py to generate dev.json/.sql and gold .sql file.

In [9]:
gold_sql = "data/spider_dev_400_gold.sql" # Gold truth for test dataset
temp_gold_sql = "data/temp_spider.sql" # Where selected gold truth for our problems will be

# load main test dataset
print("Main test dataset:")
test_data = json.load(open(test_fname))
print(f"Total: {len(test_data)}\nKeys: {test_data[0].keys()}")
print(f"Diffulty values: {set(t['difficulty'] for t in test_data)}")

# Full test:
#"""
temp_gold_sql = gold_sql
test_data_subset = test_data
#"""

# Partial test:
"""
# make a sub-set mask
mask = [False] * len(test_data)
for i in range(20):
   mask[i] = True
#mask = [ t['difficulty']=='medium' for t in test_data ]

# apply mask on test dataset
test_data_subset = [t for t, m in zip(test_data, mask) if m]
print(f"Total: {len(test_data_subset)}") 

# Step 1: Open the gold .sql file and read its content
with open(gold_sql, 'r') as file:
    glist = file.readlines()

# Step 2: apply same mask
glist_new = [g for g, m in zip(glist, mask) if m ]

# Step 3: check
for i in range(len(glist_new)):
    if glist_new[i] != test_data_subset[i]:
        Warning('There is a problem. Your testing will be wrong.')

# Step 4: save temp sql
with open(temp_gold_sql, 'w') as file:
    file.writelines(glist_new)
"""


print("\nDataset Ready for evaludation")
print(f"Total: {len(test_data_subset)}\nKeys: {test_data_subset[0].keys()}")
print(f"Diffulty values: {set(t['difficulty'] for t in test_data_subset)}")

Main test dataset:
Total: 400
Keys: dict_keys(['db_id', 'schema', 'question', 'sql', 'difficulty'])
Diffulty values: {'hard', 'easy', 'medium', 'extra'}

Dataset Ready for evaludation
Total: 400
Keys: dict_keys(['db_id', 'schema', 'question', 'sql', 'difficulty'])
Diffulty values: {'hard', 'easy', 'medium', 'extra'}

End2end run and store generated results for evalulation

TODO: 
- cache generator responses to save test time

In [10]:
run_end2end(generator, evaluator,generation_config, \
            evaluation_config, planner, retriever_gen, retriever_eval, \
                test_data_subset,dataset_name,result_fname,log_name,device_swap,prompt_method,\
                    useSchema=useSchema,params_log=params_log)

  0%|          | 0/400 [00:00<?, ?it/s]c:\Users\fahim\anaconda3\envs\r1\lib\site-packages\transformers\integrations\sdpa_attention.py:53: UserWarning: 1Torch was not compiled with flash attention. (Triggered internally at C:\cb\pytorch_1000000000000\work\aten\src\ATen\native\transformers\cuda\sdp_utils.cpp:263.)
  attn_output = torch.nn.functional.scaled_dot_product_attention(
100%|██████████| 400/400 [1:48:45<00:00, 16.31s/it]

Evaluate the stored generated results via `test-suite-sql-eval`

In [11]:
check_nltk_resource()

Requirement already satisfied: 'punkt_tab' exists in the NLTK data directory.

In [ ]:
import subprocess

db = db_path # the directory that contains all the databases and test suites
table = "data/spider/tables.json" # the tables.json schema file
pred = result_fname # the path to the predicted queries
gold = temp_gold_sql #"data/spider_dev_400_gold.sql" # the path to the gold queries
etype = "all" # evaluation type, exec for test suite accuracy, match for the original exact set match accuracy
pscript = "test-suite-sql-eval/evaluation.py" # the evaluation script

cmd = [
    "python", "-u", pscript,
    "--gold", gold,
    "--pred", pred,
    "--db", db,
    "--table", table,
    "--etype", etype
]

result = subprocess.run(cmd, capture_output=True, text=True)
print(result.stdout)
print(result.stderr)  # Check for errors

easy pred: SELECT singer.country, concert.country, concert.year FROM singer, singer_in_concert, concert WHERE singer.age > 20 AND singer_in_concertconcert_id = singer.id AND concert.stadium_id = singer_in_concertconcert_id;
easy gold: SELECT DISTINCT country FROM singer WHERE age > 20;

easy pred: SELECT course_id FROM student_enrolment_courses WHERE course_id IS NOT NULL;
easy gold: SELECT DISTINCT t1.course_name FROM courses AS t1 JOIN student_enrolment_courses AS t2 ON t1.course_id = t2.course_id;

easy pred: ;
easy gold: SELECT COUNT(DISTINCT loser_name) FROM matches;

easy pred: ;
easy gold: SELECT AVG(injured) FROM death;

easy pred: ;
easy gold: SELECT name FROM singer ORDER BY net_worth_millions ASC;

easy pred: SELECT makeid, model, make, cylinders, year FROM cars_data WHERE cylinders > 4;
easy gold: SELECT COUNT(*) FROM cars_data WHERE cylinders > 4;

easy pred: SELECT COUNT(people_id) FROM poker_player;
easy gold: SELECT COUNT(*) FROM poker_player;

easy pred: SELECT d.document_id FROM documents d LEFT JOIN documents p ON d.document_id = p.document_id COUNT(p_paragraphs) AS paragraph_count FROM paragraphs p WHERE 1 <= paragraph_count <= 2;
easy gold: SELECT document_id FROM paragraphs GROUP BY document_id HAVING COUNT(*) BETWEEN 1 AND 2;

easy pred: ;
easy gold: SELECT AVG(age) FROM visitor WHERE level_of_membership <= 4;

easy pred: ;
easy gold: SELECT title FROM cartoon WHERE directed_by = 'Ben Jones';

easy pred: SELECT COUNT(employee_id) FROM employee;
easy gold: SELECT COUNT(*) FROM employee;

easy pred: SELECT teacher.name, teacher.hometown FROM teacher WHERE teacher.hometown != 'Little Lever Urban District' ORDER BY course_id DESC;
easy gold: SELECT name FROM teacher WHERE hometown != 'little lever urban district';

easy pred: SELECT sequence FROM sqlite_sequence;
easy gold: SELECT DISTINCT countrycode FROM countrylanguage WHERE language != 'English';

easy pred: SELECT COUNT(*) FROM ( SELECT s.stuid, p.petid, p.pety, p.petyage, p.peweight FROM student s LEFT JOIN has_pet h ON s.stuid = h.stuid LEFT JOIN pets p ON h.petid = p.petid WHERE p.peweight > 10 ) AS pet_data;
easy gold: SELECT COUNT(*) FROM pets WHERE weight > 10;

easy pred: ;
easy gold: SELECT name FROM highschooler WHERE grade = 10;

easy pred: SELECT AVG(result) FROM show;
easy gold: SELECT AVG(attendance) FROM show;

easy pred: ;
easy gold: SELECT contestant_name FROM contestants WHERE contestant_name != 'Jessie Alloway';

easy pred: SELECT DISTINCT a.airline FROM flights f JOIN airlines a ON f.airline = a.airline JOIN airports i ON f.source = i.city AND f.destination = i.airportcode WHERE i.country abbrev = 'us';
easy gold: SELECT COUNT(*) FROM airlines WHERE country = 'USA';

easy pred: ;
easy gold: SELECT name FROM singer ORDER BY net_worth_millions ASC;

easy pred: SELECT COUNT(*) FROM ship WHERE name LIKE '%lost_in_battle%';
easy gold: SELECT COUNT(*) FROM ship WHERE disposition_of_ship = 'Captured';

easy pred: ;
easy gold: SELECT COUNT(*) FROM singer;

easy pred: ;
easy gold: SELECT name FROM city WHERE population BETWEEN 160000 AND 900000;

easy pred: ;
easy gold: SELECT COUNT(DISTINCT department_id) FROM degree_programs;

easy pred: ;
easy gold: SELECT airline FROM airlines WHERE abbreviation = 'UAL';

easy pred: ;
easy gold: SELECT COUNT(*) FROM cars_data WHERE year = 1980;

easy pred: SELECT earnings FROM poker_player;
easy gold: SELECT earnings FROM poker_player ORDER BY earnings DESC;

easy pred: ;
easy gold: SELECT content FROM tv_channel WHERE series_name = 'Sky Radio';

easy pred: ;
easy gold: SELECT MAX(charge_amount) FROM charges;

easy pred: ;
easy gold: SELECT template_type_code FROM ref_template_types WHERE template_type_description = 'Book';

easy pred: ;
easy gold: SELECT COUNT(*) FROM teacher;

easy pred: SELECT COUNT(pet_id) FROM ( SELECT has_id, pet_id, pet_weight FROM has_pet LEFT JOIN pets ON has_id = pets.has_id ) WHERE pet_weight > 10;
easy gold: SELECT COUNT(*) FROM pets WHERE weight > 10;

easy pred: ;
easy gold: SELECT * FROM hiring;

easy pred: ;
easy gold: SELECT COUNT(*) FROM area_code_state;

easy pred: SELECT COUNT(*) AS num_visitors_below_30 FROM visitor WHERE age < 30;
easy gold: SELECT COUNT(*) FROM visitor WHERE age < 30;

easy pred: SELECT DISTINCT country_code FROM players;
easy gold: SELECT COUNT(DISTINCT country_code) FROM players;

easy pred: SELECT grade FROM ( SELECT grade, COUNT(id) AS COUNT FROM highschooler GROUP BY grade ) WHERE COUNT >= 4;
easy gold: SELECT grade FROM highschooler GROUP BY grade HAVING COUNT(*) >= 4;

easy pred: SELECT COUNT(*) AS country_songners FROM concert JOIN singer_in_concert ON concertconcert_id = concertconcert_id JOIN singer_on_concert ON singer_on_concert.singer_id = singer.singer_id JOIN singer ON singer.singer_id LEFT JOIN stadium ON singer_on_concert.stadium_id = stadium.stadium_id GROUP BY country HAVING age > 20;
easy gold: SELECT DISTINCT country FROM singer WHERE age > 20;

easy pred: SELECT airportname FROM flights JOIN airports ON flights.airportcode = airports.airportcode WHERE sourceairport = 'AKO';
easy gold: SELECT airportname FROM airports WHERE airportcode = 'AKO';

easy pred: ;
easy gold: SELECT grade FROM highschooler WHERE name = 'Kyle';

easy pred: ;
easy gold: SELECT COUNT(*) FROM templates;

easy pred: SELECT COUNT(DISTINCT language) FROM tv_channel;
easy gold: SELECT COUNT(*) FROM tv_channel WHERE language = 'English';

easy pred: ;
easy gold: SELECT name FROM conductor ORDER BY year_of_work DESC;

easy pred: ;
easy gold: SELECT COUNT(DISTINCT language) FROM countrylanguage;

easy pred: ;
easy gold: SELECT COUNT(*) FROM singer;

easy pred: ;
easy gold: SELECT zip_postcode FROM addresses WHERE city = 'Port Chelsea';

easy pred: SELECT COUNT(DISTINCT player_id) AS number_of_players FROM players;
easy gold: SELECT COUNT(*) FROM players;

easy pred: SELECT COUNT(DISTINCT teacher_id) FROM course_arrange;
easy gold: SELECT COUNT(*) FROM teacher;

easy pred: SELECT COUNT(DISTINCT treatment_id) AS number_of_providers FROM treatments LEFT JOIN professionals ON professionals.proessional_id = treatments.proessional_id GROUP BY treatment_id;
easy gold: SELECT COUNT(DISTINCT professional_id) FROM treatments;

easy pred: ;
easy gold: SELECT nationality FROM people GROUP BY nationality HAVING COUNT(*) >= 2;

easy pred: SELECT COUNT(DISTINCT type) FROM pets;
easy gold: SELECT COUNT(DISTINCT pettype) FROM pets;

easy pred: SELECT COUNT(employee_id) FROM employee;
easy gold: SELECT COUNT(*) FROM employee;

easy pred: ;
easy gold: SELECT COUNT(*) FROM countries;

easy pred: SELECT SUM(bonus) AS totalbonus FROM evaluation;
easy gold: SELECT SUM(bonus) FROM evaluation;

easy pred: SELECT COUNT(DISTINCT poker_player_id) AS number_of_players FROM poker_player;
easy gold: SELECT COUNT(*) FROM poker_player;

easy pred: ;
easy gold: SELECT name FROM teacher ORDER BY age ASC;

easy pred: ;
easy gold: SELECT name FROM singer WHERE citizenship != 'France';

easy pred: SELECT AVG(mpg) AS average_horsepower FROM cars_data WHERE year < 1980 JOIN cars_data ON (SELECT * FROM cars_data WHERE year < 1980);
easy gold: SELECT AVG(horsepower) FROM cars_data WHERE year < 1980;

easy pred: ;
easy gold: SELECT grade FROM highschooler;

easy pred: ;
easy gold: SELECT other_student_details FROM students ORDER BY other_student_details DESC;

easy pred: SELECT COUNT(airline) FROM airlines WHERE country = 'USA';
easy gold: SELECT COUNT(*) FROM airlines WHERE country = 'USA';

easy pred: ;
easy gold: SELECT episode FROM tv_series ORDER BY rating;

easy pred: ;
easy gold: SELECT AVG(age) FROM dogs;

easy pred: SELECT population FROM city WHERE name = 'Gelderland district';
easy gold: SELECT SUM(population) FROM city WHERE district = 'Gelderland';

easy pred: ;
easy gold: SELECT AVG(attendance) FROM show;

easy pred: ;
easy gold: SELECT country_code FROM players GROUP BY country_code HAVING COUNT(*) > 50;

easy pred: ;
easy gold: SELECT document_id FROM paragraphs GROUP BY document_id HAVING COUNT(*) >= 2;

easy pred: SELECT t.table_id FROM templates t WHERE t.table_id IN ( SELECT COUNT(d document_id) FROM documents d WHERE d.template_id = t.table_id ) AND COUNT(d document_id) > 1;
easy gold: SELECT template_id FROM documents GROUP BY template_id HAVING COUNT(*) > 1;

easy pred: ;
easy gold: SELECT name FROM conductor WHERE nationality != 'USA';

easy pred: SELECT (SUM(poker_player_earnings)) / (COUNT(poker_player_id)) AS average_earnings;
easy gold: SELECT AVG(earnings) FROM poker_player;

easy pred: SELECT SUM(evaluation_bonus) FROM evaluation LEFT JOIN evaluation ON evaluation.employee_id = evaluation.employee_id;
easy gold: SELECT SUM(bonus) FROM evaluation;

easy pred: SELECT COUNT(DISTINCT student_course_id) AS total_transcripts FROM ( SELECT student_course_id FROM student_enrolment_courses WHERE student_course_id NOT NULL ) AS student_courses cross join ( SELECT transcript_id FROM transcripts WHERE transcript_id NOT NULL ) AS transcript_ids GROUP BY student_course_id, transcript_id COUNT(DISTINCT student_course_id, transcript_id) );
easy gold: SELECT COUNT(*) FROM transcripts;

easy pred: ;
easy gold: SELECT country_code FROM players GROUP BY country_code HAVING COUNT(*) > 50;

easy pred: ;
easy gold: SELECT name FROM teacher WHERE hometown != 'little lever urban district';

easy pred: ;
easy gold: SELECT COUNT(*) FROM country WHERE continent = 'Asia';

easy pred: SELECT coalesce (average (age)) AS average_age FROM dogs GROUP BY owner_id;
easy gold: SELECT AVG(age) FROM dogs;

easy pred: ;
easy gold: SELECT COUNT(*) FROM singer;

easy pred: SELECT airport_name FROM flights WHERE (source_airport = airport_name OR dest_airport = airport_name);
easy gold: SELECT airportname FROM airports WHERE airportcode = 'AKO';

easy pred: SELECT tv_series.weekly_rank FROM tv_series WHERE tv_seriesepisode = 'A Love of a Lifetime';
easy gold: SELECT weekly_rank FROM tv_series WHERE episode = 'A Love of a Lifetime';

easy pred: ;
easy gold: SELECT COUNT(*) FROM cars_data WHERE cylinders > 4;

easy pred: SELECT h.shop_id, h.employee_id, h.name, h.start_from, h.is_full_time FROM hiring h LEFT JOIN employee e ON h.employee_id = e.employee_id WHERE h.is_full_time = 'Yes';
easy gold: SELECT * FROM hiring;

easy pred: SELECT DISTINCT template_id FROM documents;
easy gold: SELECT COUNT(DISTINCT template_id) FROM documents;

easy pred: ;
easy gold: SELECT COUNT(DISTINCT dog_id) FROM treatments;

easy pred: SELECT COUNT(DISTINCT nationality) AS nationality_count FROM people .;
easy gold: SELECT COUNT(DISTINCT nationality) FROM people;

easy pred: ;
easy gold: SELECT grade FROM highschooler WHERE name = 'Kyle';

easy pred: SELECT t.name FROM matches m GROUP BY m.tournament_id HAVING COUNT(m) > 10;
easy gold: SELECT tourney_name FROM matches GROUP BY tourney_name HAVING COUNT(*) > 10;

easy pred: SELECT COUNT(DISTINCT nationality) AS numberofnationalities FROM conductor;
easy gold: SELECT COUNT(DISTINCT nationality) FROM conductor;

easy pred: SELECT s.first_name FROM students s WHERE s.current_address_id = s.current_address_id AND s.permanent_address_id = s.permanent_address_id AND s.permanent_address_id != s.current_address_id;
easy gold: SELECT first_name FROM students WHERE current_address_id != permanent_address_id;

easy pred: ;
easy gold: SELECT COUNT(*) FROM country WHERE continent = 'Asia';

easy pred: ;
easy gold: SELECT COUNT(*) FROM flights;

easy pred: SELECT section_name FROM table_name ORDER BY section_name DESC;
easy gold: SELECT section_name FROM sections ORDER BY section_name DESC;

easy pred: ;
easy gold: SELECT COUNT(*) FROM cars_data WHERE year = 1980;

easy pred: SELECT coalesce (record_company, 'Unknown') AS record_company, coalesce (year_of_founded, 0) AS year_of_founded FROM orchestra LEFT JOIN conductor ON conductor_id = orchestra_id ORDER BY year_of_founded DESC;
easy gold: SELECT record_company FROM orchestra ORDER BY year_of_founded DESC;

easy pred: SELECT c.name AS country_name FROM country c LEFT JOIN sqlite_sequence sq ON c.code = sq.code WHERE sq indepyear > 1950 ORDER BY c.seq SELECT c.name FROM country c LEFT JOIN sqlite_sequence sq ON c.code = sq.code WHERE sq indepyear > 1950 ORDER BY c.seq;
easy gold: SELECT name FROM country WHERE indepyear > 1950;

easy pred: ;
easy gold: SELECT COUNT(*) FROM airlines;

easy pred: ;
easy gold: SELECT COUNT(*) FROM matches;

medium pred: ;
medium gold: SELECT name, location, district FROM shop ORDER BY number_products DESC;

medium pred: SELECT COUNT(flightno) FROM flights WHERE airline = ' unify ' AND sourceairport = 'AHD';
medium gold: SELECT COUNT(*) FROM airlines AS t1 JOIN flights AS t2 ON t2.airline = t1.uid WHERE t1.airline = 'United Airlines' AND t2.sourceairport = 'AHD';

medium pred: SELECT COUNT(DISTINCT concert_id) AS concert_count FROM concert WHERE stadium_id = (SELECT stadium_id FROM stadium);
medium gold: SELECT t2.name, COUNT(*) FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id GROUP BY t1.stadium_id;

medium pred: ;
medium gold: SELECT SUM(t2.total_spent) FROM visitor AS t1 JOIN visit AS t2 ON t1.id = t2.visitor_id WHERE t1.level_of_membership = 1;

medium pred: ;
medium gold: SELECT name, date FROM battle;

medium pred: ;
medium gold: SELECT name, birth_date FROM people ORDER BY name ASC;

medium pred: SELECT pixel_aspect_ratio_par, country, language FROM tv_channel WHERE language != 'English' LIMIT 1;
medium gold: SELECT pixel_aspect_ratio_par, country FROM tv_channel WHERE language != 'English';

medium pred: ;
medium gold: SELECT name FROM country ORDER BY population DESC LIMIT 3;

medium pred: ;
medium gold: SELECT t1.first_name, t2.name FROM owners AS t1 JOIN dogs AS t2 ON t1.owner_id = t2.owner_id;

medium pred: SELECT COUNT(*) AS total FROM friend WHERE student_id = (SELECT id FROM highschooler WHERE name = 'Kyle' AND friend_id IS NOT NULL);
medium gold: SELECT COUNT(*) FROM friend AS t1 JOIN highschooler AS t2 ON t1.student_id = t2.id WHERE t2.name = 'Kyle';

medium pred: SELECT p.property_type_description FROM properties p LEFT JOIN (SELECT c.property_type_code, COUNT(*) AS COUNT FROM properties p WHERE p.property_type_code = c.property_type_code) c ON c.property_type_code = p.property_type_code;
medium gold: SELECT t2.property_type_description FROM properties AS t1 JOIN ref_property_types AS t2 ON t1.property_type_code = t2.property_type_code GROUP BY t1.property_type_code;

medium pred: SELECT petweight FROM pets WHERE pettype = 'dog' ORDER BY pet_age ASC;
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1;

medium pred: ;
medium gold: SELECT t2.created, t2.state, t2.phone_number FROM contestants AS t1 JOIN votes AS t2 ON t1.contestant_number = t2.contestant_number WHERE t1.contestant_name = 'Tabatha Gehling';

medium pred: SELECT c.cylinders, MAX(a.c.accel) AS max_accel FROM ( SELECT c.cylinders, a.caccel, COUNT(a.caccel) AS count_a FROM cars_data a, cars_data c WHERE c.cylinders = a.cylinders ) AS t;
medium gold: SELECT MAX(accelerate), cylinders FROM cars_data GROUP BY cylinders;

medium pred: SELECT MAX(transcript_date) AS last_transcript_date FROM transcripts;
medium gold: SELECT transcript_date FROM transcripts ORDER BY transcript_date DESC LIMIT 1;

medium pred: ;
medium gold: SELECT age, hometown FROM teacher;

medium pred: ;
medium gold: SELECT t2.template_id FROM ref_template_types AS t1 JOIN templates AS t2 ON t1.template_type_code = t2.template_type_code WHERE t1.template_type_description = 'Presentation';

medium pred: ;
medium gold: SELECT record_company, COUNT(*) FROM orchestra GROUP BY record_company;

medium pred: SELECT singer.name, singer.net_worth_millions, singer.citizenship FROM singer WHERE singer.singer_id IN (SELECT singer.singer_id FROM song);
medium gold: SELECT citizenship, MAX(net_worth_millions) FROM singer GROUP BY citizenship;

medium pred: SELECT winner_name, loser_name FROM matches WHERE minutes = ( SELECT MAX('minutes') FROM matches );
medium gold: SELECT winner_name, loser_name FROM matches ORDER BY minutes DESC LIMIT 1;

medium pred: ;
medium gold: SELECT AVG(loser_age), AVG(winner_age) FROM matches;

medium pred: SELECT grade, COUNT(*) AS total_from_grade FROM highschooler GROUP BY grade ORDER BY grade;
medium gold: SELECT grade, COUNT(*) FROM highschooler GROUP BY grade;

medium pred: ;
medium gold: SELECT COUNT(*), city FROM employee GROUP BY city;

medium pred: SELECT DISTINCT nationality FROM people;
medium gold: SELECT nationality, COUNT(*) FROM people GROUP BY nationality;

medium pred: SELECT COUNT(flightno) FROM flights WHERE airline = 'United' AND destairport = 'ASY';
medium gold: SELECT COUNT(*) FROM airlines AS t1 JOIN flights AS t2 ON t2.airline = t1.uid WHERE t1.airline = 'United Airlines' AND t2.destairport = 'ASY';

medium pred: ;
medium gold: SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1;

medium pred: ;
medium gold: SELECT birth_year, citizenship FROM singer;

medium pred: SELECT MIN(weight) AS smallest_weight FROM cars_data WHERE year = 1974 AND cylinders = 8;
medium gold: SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974;

medium pred: ;
medium gold: SELECT first_name, middle_name, last_name FROM students ORDER BY date_first_registered ASC LIMIT 1;

medium pred: SELECT teacher.name, course.course FROM course_arrange (c) JOIN course (c) WHERE c.course_id = c.course_id;
medium gold: SELECT t3.name, t2.course FROM course_arrange AS t1 JOIN course AS t2 ON t1.course_id = t2.course_id JOIN teacher AS t3 ON t1.teacher_id = t3.teacher_id;

medium pred: ;
medium gold: SELECT email_address, cell_number, home_phone FROM professionals;

medium pred: ;
medium gold: SELECT name FROM visitor WHERE level_of_membership > 4 ORDER BY level_of_membership DESC;

medium pred: ;
medium gold: SELECT t1.name, t2.orchestra FROM conductor AS t1 JOIN orchestra AS t2 ON t1.conductor_id = t2.conductor_id;

medium pred: SELECT MAX(version_number) AS highest_version, template_type_code FROM templates;
medium gold: SELECT version_number, template_type_code FROM templates WHERE version_number > 5;

medium pred: SELECT vote_id FROM votes WHERE state = 'NY' OR state = 'CA';
medium gold: SELECT COUNT(*) FROM votes WHERE state = 'NY' OR state = 'CA';

medium pred: ;
medium gold: SELECT COUNT(t2.language) FROM country AS t1 JOIN countrylanguage AS t2 ON t1.code = t2.countrycode WHERE t1.name = 'Aruba';

medium pred: SELECT s.stuid, COUNT(p petid) AS pet_count FROM student s JOIN has_pet h ON s.stuid = h.stuid GROUP BY s.stuid HAVING COUNT(p petid) > 0;
medium gold: SELECT COUNT(*), t1.stuid FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid GROUP BY t1.stuid;

medium pred: ;
medium gold: SELECT first_name, last_name FROM players WHERE hand = 'L' ORDER BY birth_date;

medium pred: ;
medium gold: SELECT t2.title FROM tv_channel AS t1 JOIN cartoon AS t2 ON t1.id = t2.channel WHERE t1.series_name = 'Sky Radio';

medium pred: ;
medium gold: SELECT language, countrycode, MAX(percentage) FROM countrylanguage GROUP BY countrycode;

medium pred: ;
medium gold: SELECT vote_id, phone_number, state FROM votes;

medium pred: SELECT pet_type, AVG(weight) AS average_weight FROM ( SELECT student_id, pet_id FROM student WHERE student_id = (SELECT student_id FROM has_pet WHERE student_id = any (1)) ; SELECT student_id, pet_id FROM has_pet WHERE student_id = any (1) ; SELECT pet_id FROM pets WHERE pet_id = any (1) ) AS joined_table GROUP BY pet_type ORDER BY pet_type;
medium gold: SELECT AVG(weight), pettype FROM pets GROUP BY pettype;

medium pred: ;
medium gold: SELECT t1.first_name, t2.name FROM owners AS t1 JOIN dogs AS t2 ON t1.owner_id = t2.owner_id WHERE t1.state = 'Virginia';

medium pred: SELECT COUNT(*) AS numberoforchestras FROM orchestra WHERE major_record_format = 'CD' OR major_record_format = 'DVD';
medium gold: SELECT COUNT(*) FROM orchestra WHERE major_record_format = 'CD' OR major_record_format = 'DVD';

medium pred: ;

Save eval results

In [12]:
# Save output to a text file
with open(result_eval_fname, "w") as f:
    f.write(result.stdout)

# Optional: Print confirmation
print(f"Output saved to: {result_eval_fname}")

Output saved to: results/DeepSeek-R1-Distill-Qwen-1.5B_TinyLlama-1.1B-Chat-v1.0_base_spider_greedy_check_e2e_t2_20250220_174605.txt

In [13]:
# Clear all variables
%reset -f

# Clear memory for PyTorch (if using GPU)
import torch
torch.cuda.empty_cache()

# Garbage collection to free up memory
import gc
gc.collect()

0